tap "nikitabobko/tap"
tap "sst/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Improved top (interactive process viewer)
brew "htop"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Smart session manager for the terminal
brew "sesh"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Insiders build of Visual Studio Code
cask "visual-studio-code@insiders"
# Gecko based web browser
cask "zen"
